let target_group = dynamic([
//emails here
]);
//target devices need to be updated
let target_devices = dynamic([
//devices here
]);
DeviceEvents
| where ActionType in (
    "SensitiveFileRead"
)
| where InitiatingProcessAccountUpn in (target_group)
    or DeviceName in (target_devices)
| project TimeGenerated, InitiatingProcessAccountUpn, DeviceName, FolderPath, FileName
