let UPName = "userprincipalnamehere"; 
let TimeFrame = ago(30d); 
SigninLogs 
| where TimeGenerated > TimeFrame
| where UserPrincipalName =~ UPName
| summarize FSeen = min(TimeGenerated), LSeen = max(TimeGenerated), SuccessCount = count(ResultType = 0), FailCount = count(ResultType != 0) 
by UserPrincipalName, IPAddress, tostring(DeviceDetail.deviceId), UserAgent, Location
