let startDateOfAlert = startofday(now());
let StartAlertTime = startDateOfAlert + 1h;
let StopAlertTime = startDateOfAlert + 4h;

let today_start    = startofday(now());
let ago3days_start = startofday(ago(3d));
let ago2days_start = startofday(ago(2d));
let ago1days_start = startofday(ago(1d));
union SigninLogs, AADNonInteractiveUserSignInLogs
| where TimeGenerated between ((today_start + 1h) .. (today_start + 4h))
| summarize max(TimeGenerated) by LocationDetails_string, Identity, UserPrincipalName, IPAddress

let today_start    = startofday(now());
let ago3days_start = startofday(ago(3d));
let ago2days_start = startofday(ago(2d));
let ago1days_start = startofday(ago(1d));
union SigninLogs, AADNonInteractiveUserSignInLogs
| where TimeGenerated between ((today_start + 1h) .. (today_start + 4h))
| summarize max(TimeGenerated) by LocationDetails_string, Identity, UserPrincipalName, IPAddress
| join kind=leftantisemi (
    union SigninLogs, AADNonInteractiveUserSignInLogs
    | where TimeGenerated between ((ago1days_start + 1h) .. (ago1days_start + 4h))
    | summarize max(TimeGenerated) by LocationDetails_string, Identity, UserPrincipalName, IPAddress
) on UserPrincipalName, IPAddress


let ago3days_start = startofday(ago(3d));
let ago2days_start = startofday(ago(2d));
let ago1days_start = startofday(ago(1d));
union SigninLogs, AADNonInteractiveUserSignInLogs
| where TimeGenerated between ((ago1days_start + 1h) .. (ago1days_start + 4h))
| summarize max(TimeGenerated) by LocationDetails_string, Identity, UserPrincipalName, IPAddress




//    and TimeGenerated between ((ago2days_start + 1h) .. (ago2days_start + 4h))
//   and TimeGenerated between ((ago3days_start + 1h) .. (ago3days_start + 4h))
