// ༼ ಢ_ಢ ༽
SigninLogs
| extend S1 = parse_json(AuthenticationDetails)[0]
| extend S2 = parse_json(AuthenticationDetails)[1]
| where not(isempty(S2))
| extend StatusManual = (S1.succeeded != "true" or S2.succeeded != "true")
